#Номер 2.25 Выполнил: Кузнецов Александр ИУ7-13
from math import *
L=[0]*11
summa = 0
print("Введите массив")
#Ввод элементов массива
L=[float(input()) for i in range (11)]
print (L)
#Подсчет суммы
for i in range(len(L)): summa +=L[i]
#Поиск элементов делящихся на 7 без остатка
for i in range(len(L)):
#Если такой элемент найден, то вместо него записывается сумма предыдущих
 if L[i]%7==0:
    L[i]=summa-L[i]
    print(L)
    break
else: print("Не найдено ни одного элемента делющегося на 7")


