from math import*
def y(x):
    return x*x
a=float(input('Введите нижний предел интеграла\n'))
b=float(input('Введите верхний предел интеграла\n'))
eps=float(input('Введите точность нахождения площади\n'))
h=b-a
h2=(b-a)/4
s2=2*h2/45*(7*y(a)+32*y(a+h2)+12*y(a+2*h2)+32*y(b-h2)+7*y(b))
s=h*y(a)
s1=h*(y(a)+y(a+h/2))/2
i=1
while abs(s-s1)>eps:
    i*=2
    p=h/i
    s=p*y(a)
    s1=p/2*y(a)
    for t in range(1,i):
        s+=y(a+t*p)*p
    for t in range(1,2*i):
        s1+=y(a+t*p/2)*p/2
    f=i
    
n1=int(input('Введите первое количество разбиений\n'))
n2=int(input('Введите второе количество разбиений\n'))
s10=h*y(a)
p=h/n1
for t in range(1,n1):
    s10+=y(a+t*p)*p
s100=h*y(a)
p=h/n2
for t in range(1,n2):
    s100+=y(a+t*p)*p


print('-'*21,'+','-'*10,'+','-'*10,'\\')
print('    Метод             |    n=',n1,'   |    n=',n2,'   |')
print('-'*21,'+','-'*10,'+','-'*10,'|')
print('Левых прямоугольников |','{:8.3f}'.format(s10),'  |','{:8.3f}'.format(s100),'  |')
print('-'*21,'+','-'*10,'+','-'*10,'|')
print('Булля                 |','{:8.3f}'.format(s2),'  |','{:8.3f}'.format(s2),'  |')
print('-'*21,'+','-'*10,'+','-'*10,'/')

print('Площадь в пределах от ',a,' до ',b,' по методу левых прямоугольников равна','{:7.3f}'.format(s),', Количетсво разбиений',f)
