#Бесконечная сумма рядов вида z=x + x^3/3! + ... (Выполнил: Кузнецов А.В. ИУ7-13
from math import *
#Ввод переменных: х, эпселон, начального значения цикла, конечного значения цикла, шага печати
x = float(input("Задайте значение Х: "))
eps = float(input("Введите значение Eps: "))
N = int(input("Введите начальное значение цикла: "))
n = int(input("Введите конечное значение цикла: "))
sh = int(input("Введите шаг для печати: "))
k=sh
j=0
z=0
#Построение таблицы
print("-------------------------------------------------")
print("| шаг (n) | Текущее значечение | Текущая сумма  |")
print("-------------------------------------------------")
#Расчет бесконечного ряда от начального значения до конечного
for i in range(N,n+1):
    j=j+1
    #Согласно исходной формуле принимаются только нечетные значения n
    if i % 2 !=0:
      #Проверка на то, равно ли текущее значение эпселонту, если число больше, считаем сумму дальше
      if abs(x**i/factorial(i)) > abs(eps):
        z+=x**i/factorial(i)
        #Высчитывает шаг для печати
        if k==sh or fmod(k,sh)==0:
          
          print("|","{:4.0f}".format(i),"   |","{:12.5}".format(x**i/factorial(i)),"      |","{:10.7}".format(z),"    |")
          print("-------------------------------------------------")
        k+=1
      else:
        #При схождении ряда цикл обрывается и выдается сообщение, что ряд сошелся
        z+=x**i/factorial(i)
        print("Ряд сошелся при шаге n = ",i, "  Текущ. значение = ","{:12.5}".format(x**i/factorial(i)),"  текущая сумма = ", round(z,7))
        break
    #если ряд не сошелся за N цикл, то выводится сообщение
    if n == j and  abs(x**i/factorial(i))>= abs(eps): print("Ряд не сошелся за ",n," - цикл, текущее значение шага n= ",i ,"текущая сумма = ", round(z,7),"Текущ.значение = ","{:12.5}".format(x**i/factorial(i)))
